/*********************************************************************************************************
* 模块名称：RADIO.h
* 摘    要：无线模块，包括无线模块初始化，以及中断服务函数处理，以及读写串口函数实现
* 当前版本：1.0.0
* 作    者：LYL(COPYRIGHT 2021 - 2021 LYL. All rights reserved.)
* 完成日期：2021年10月14日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _RADIO_H_
#define _RADIO_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include "DataType.h"
#include "stm32f10x_gpio.h"
#include "UART1.h"
#include "SysTick.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
typedef enum
{
    MODEM_TRANSFER = 0x00, //传输模式
    MODEM_WOR = 0x01,          //发送方-可唤醒同模式的接收方,接收方-低功耗睡眠监听
    MODEM_CONFIG = 0x02,       //配置模式
    MODEM_DEEPSLEEP = 0x03,    //深度睡眠
}RadioModems_t;


/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  DeInitLORA(void);          //初始化模块参数---恢复出厂设置
void  InitLORA(void);            //初始化LORA模块模式
uint8    SetLRMode(uint8 NewMode);//设置LORA工作模式
uint8    isLoRaReady(void);         //查询模块是否准备好
uint8    RadioSendData(uint8 *pBufData, uint8 size);//无线发送数据
void  RadioSendCMD(void);
void  RadioRx( uint32 timeout );    //在给定时间将模块设置为接收模式
uint16   getAddress(void);              //返回模块地址
#endif
